docs/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en_US" xml:lang="en_US">
<head>
<!-- 2022-07-07 Thu 15:06 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Yet Another Emacs Configuration</title>
<meta name="author" content="Thomas Freeman" />
<meta name="keywords" content="Emacs" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Yet Another Emacs Configuration</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org8c56220">Welcome</a></li>
<li><a href="#org1d5fb21">About My Emacs Setup</a></li>
<li><a href="#org90d9016">Browse the Configuration</a></li>
<li><a href="#org0c6f59b">Emacs in Different Environments</a>
<ul>
<li><a href="#orge5e95b2">Emacs from Flash Drive</a></li>
<li><a href="#org90b67d8">Emacs in Windows</a></li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-org8c56220" class="outline-2">
<h2 id="org8c56220">Welcome</h2>
<div class="outline-text-2" id="text-org8c56220">
<p>
Welcome to the Github page for my Emacs configuration. I have created this Github pages site to provide place where I can post the custom modifications I have made to Emacs. My goal is to make Emacs  as productive as possible. While Emacs has excellent documentation that I highly recommend reading, there is much more in the Emacs ecosystem that the manual doesn't even begin to cover. There are many excellent third-party packages that have been released to extend Emacs. This is why I have decided that I would post my own Emacs configuration for anyone else who wants to learn by example. I have certainly found a lot of inspiration in scouring the internet for Emacs configurations created by other users.
</p>
</div>
</div>

<div id="outline-container-org1d5fb21" class="outline-2">
<h2 id="org1d5fb21">About My Emacs Setup</h2>
<div class="outline-text-2" id="text-org1d5fb21">
<p>
I have tried to make an Emacs setup that is flexible for use in multiple contexts. While I prefer to use libre operating systems. I often find that for work I am limited to using a Windows system. As I have learned to rely on the powerful features of Emacs for much of the computing that I do, I have found a way to replicate the functions I love on Emacs as a portable system by running Emacs on a USB flash drive (based on <a href="https://francopasut.medium.com/make-emacs-totally-portable-under-windows-c8c04156455f">this article</a>) alongside the <a href="https://portableapps.com/">PortableApps</a> platform. This allows me to take my Emacs setup everywhere I go. Here are some features of my setup:
</p>

<ol class="org-ol">
<li>Emacs Server
<ul class="org-ul">
<li>Starts an Emacs server on the first launch of an Emacs instance</li>
<li>Emacs frames can be opened quickly and access the same buffers by running an <code>emacsclient</code> instance.</li>
</ul></li>
<li>Fast Loading
<ul class="org-ul">
<li>Package loading is deferred with use-package when possible</li>
<li>Designed to load quickly on older computers and from a flash drives</li>
</ul></li>
<li>Modular
<ul class="org-ul">
<li>Configuration files are split into modules, with each module as a separate Elisp file</li>
<li>This makes reading the configuration simpler and makes debugging easier</li>
<li>Modules can easily be disabled</li>
</ul></li>
<li>Multi-platform
<ul class="org-ul">
<li>This configuration has been tested on:
<ul class="org-ul">
<li>GNU GUIX</li>
<li>Linux Mint</li>
<li>Windows using Chocolatey to install dependencies</li>
<li>Windows as a USB PortableApp with dependencies installed on the USB drive as PortableApps</li>
</ul></li>
</ul></li>
<li>Portable
<ul class="org-ul">
<li>A file, runemacs.bat, will call the Emacs executable on the USB flash drive and set the home directory to the drive label of the flash drive.</li>
<li>Emacs will check to see if it is being called as a portable app and can call on portable libraries such as MikTeX portable and Git portable to restore lost functionality.</li>
<li>The Emacs configuration can be pulled from Github and uses straight.el to pull install all Emacs packages.</li>
</ul></li>
<li>Window Management with EXWM
<ul class="org-ul">
<li>If no window manger is detected, EXWM can be used as the window manager</li>
<li>All applications can be opened in Emacs and managed with Emacs commands</li>
</ul></li>
</ol>
</div>
</div>

<div id="outline-container-org90d9016" class="outline-2">
<h2 id="org90d9016">Browse the Configuration</h2>
<div class="outline-text-2" id="text-org90d9016">
<p>
I use Org Mode to program my <code>init.el</code> file with my annotations, documentation, explanations, and links to source code and sites where I borrowed my code from. The Org Mode file as source code blocks that are tangled to <code>init.el</code>.  If you wish to go straight to the raw Elisp files, you can visit the <a href="https://github.com/tfree87/.emacs.d">Github page</a>, otherwise the following links will let you peruse through my configuration and read the commentary that accompanies it:
</p>

<dl class="org-dl">
<dt><a href="early-init.html">early-init.html</a></dt><dd>A file that is loaded before <code>init.el</code></dd>
<dt><a href="init.html">init.html</a></dt><dd>Browse the code along with my commentary exported to HTML from my <code>init.org</code> file.</dd>
</dl>
</div>
</div>

<div id="outline-container-org0c6f59b" class="outline-2">
<h2 id="org0c6f59b">Emacs in Different Environments</h2>
<div class="outline-text-2" id="text-org0c6f59b">
</div>
<div id="outline-container-orge5e95b2" class="outline-3">
<h3 id="orge5e95b2">Emacs from Flash Drive</h3>
<div class="outline-text-3" id="text-orge5e95b2">
<p>
If you want to run Emacs as a portable application, see <a href="emacs-portable.html">Emacs as a Portable Application</a>.
</p>
</div>
</div>

<div id="outline-container-org90b67d8" class="outline-3">
<h3 id="org90b67d8">Emacs in Windows</h3>
<div class="outline-text-3" id="text-org90b67d8">
<p>
Emacs can be a very powerful tool in Windows. For some tips on how to <a href="emacs-windows,html">Emacs Windows Customizations</a>
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2022-03-30 Wed 00:00</p>
<p class="author">Author: Thomas Freeman</p>
<p class="date">Created: 2022-07-07 Thu 15:06</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
